Дошкольное_учреждение83/src/Catalogs/удуНаименованияПрограммПроектов/удуНаименованияПрограммПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуНаименованияПрограммПроектов</name>
  <attributes>
    <name>ВидПрограммыПроекта</name>
    <type>
      <types>EnumRef.удуУровниПрограммПроектов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуУровниПрограммПроектов/удуУровниПрограммПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуУровниПрограммПроектов</name>
  <enumValues>
    <name>АккредитованныеОбразовательныеПрограммы</name>
  </enumValues>
  <enumValues>
    <name>РеализуемыеПрограммыПроекты</name>
  </enumValues>
  <enumValues>
    <name>СоциальныеПрограммыПроекты</name>
  </enumValues>
  <enumValues>
    <name>НаправленияДополнительногоОбразования</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуНаименованияПрограммПроектов/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		НаименованиеВидаПрограммы = Параметры.ВидПрограммы;
		ЭлементОтбораПоВидуПрограммы = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПоВидуПрограммы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораПоВидуПрограммы.Использование = Истина;
		ЭлементОтбораПоВидуПрограммы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПрограммыПроекта");
		Если НаименованиеВидаПрограммы = "ОбразовательныеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.АккредитованныеОбразовательныеПрограммы;
		ИначеЕсли НаименованиеВидаПрограммы = "РеализуемыеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.РеализуемыеПрограммыПроекты;
		ИначеЕсли НаименованиеВидаПрограммы = "СоциальныеПрограммы" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.СоциальныеПрограммыПроекты;
		ИначеЕсли НаименованиеВидаПрограммы = "Направления" Тогда
			ЭлементОтбораПоВидуПрограммы.ПравоеЗначение = Перечисления.удуУровниПрограммПроектов.НаправленияДополнительногоОбразования;
		КонецЕсли;	
		ЭлементОтбораПоВидуПрограммы.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Исключение
	КонецПопытки;		
КонецПроцедуры
